In [59]:
pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl

   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   ---------------------------------------- 2/2 [openpyxl]

Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
pip install pandas

Collecting pandas
  Downloading pandas-2.3.3-cp314-cp314-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\aurora\appdata\local\programs\python\python314\lib\site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\aurora\appdata\roaming\python\python314\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\aurora\appdata\roaming\python\python314\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.3-cp314-cp314-win_amd64.whl (11.1 MB)
   ---------------------------------------- 0.0/11.1 MB ? eta -:--:--
   - -------------------------------------- 0.5/11.1 MB 5.5 MB/s eta 0:00:02
   ------ --------------------------------- 1.8/11.1 MB 5.9 MB/s eta 0:00:02
   ----------- ---------------------------- 3.1/11.1 MB 5.9 MB/s eta 0:00:02
   --------------- ------------------------ 4.2/11.1 MB 5.9 MB/s eta 0:00:02
   ------------------- -------------------- 5.5/11.1 MB 5.9 MB/s eta 0:00:01
   ----------------------- ---------------- 6.6/11.1 MB 5.9 MB/s eta 0:00:01
   ---------------------------- ----------- 7.9/11.1 MB 5.9 MB/s eta 0:00:01
   --------------------------------- ------ 9.2/11.1 MB 5.9 MB/s eta 0:00:01
   ------------------------------------ --- 10.2/11.1 MB 5.9 MB/s eta 0:00:01
   ---------------------------------------- 11.1/11.1 MB 5.9 MB/s  0:00:01
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas

   ---------------------------------------- 0/3 [pytz]
   ------------- -------------------------- 1/3 [tzdata]
   ------------- -------------------------- 1/3 [tzdata]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   ---------------------------------------- 3/3 [pandas]

Successfully installed pandas-2.3.3 pytz-2025.2 tzdata-2025.2
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
import numpy as np
import pandas as pd

In [4]:
data = {
    'Öğrenci': ['Ayşe', 'Fatma', 'Ali', 'Ömer', 'Buse', 'Evren', 'Zeynep'],
    'Matematik': [85, 65, 35, 92, 88, 76, 95],
    'Fizik': [42, 51, 38, 64, 75, 30, 15],
    'Yaş': [17, 18, 17, 18, 17, 19, 19],
    'Sınıf': ['11A','11B','11C','11B','11B','11A','11C'] }

In [5]:
print(data)

{'Öğrenci': ['Ayşe', 'Fatma', 'Ali', 'Ömer', 'Buse', 'Evren', 'Zeynep'], 'Matematik': [85, 65, 35, 92, 88, 76, 95], 'Fizik': [42, 51, 38, 64, 75, 30, 15], 'Yaş': [17, 18, 17, 18, 17, 19, 19], 'Sınıf': ['11A', '11B', '11C', '11B', '11B', '11A', '11C']}

In [7]:
df = pd.DataFrame(data)
df

  Öğrenci  Matematik  Fizik  Yaş Sınıf
0    Ayşe         85     42   17   11A
1   Fatma         65     51   18   11B
2     Ali         35     38   17   11C
3    Ömer         92     64   18   11B
4    Buse         88     75   17   11B
5   Evren         76     30   19   11A
6  Zeynep         95     15   19   11C

In [9]:
# head() fonksiyonu ilk 5 veriyi listeler
df.head(3)

  Öğrenci  Matematik  Fizik  Yaş Sınıf
0    Ayşe         85     42   17   11A
1   Fatma         65     51   18   11B
2     Ali         35     38   17   11C

In [10]:
# tail() fonksiyonu sondan ilk 5 veriyi listeler
df.tail(2)

  Öğrenci  Matematik  Fizik  Yaş Sınıf
5   Evren         76     30   19   11A
6  Zeynep         95     15   19   11C

In [11]:
df.describe()

       Matematik      Fizik        Yaş
count   7.000000   7.000000   7.000000
mean   76.571429  45.000000  17.857143
std    20.982986  20.330601   0.899735
min    35.000000  15.000000  17.000000
25%    70.500000  34.000000  17.000000
50%    85.000000  42.000000  18.000000
75%    90.000000  57.500000  18.500000
max    95.000000  75.000000  19.000000

In [12]:
# sütun seçme
df['Matematik']

0    85
1    65
2    35
3    92
4    88
5    76
6    95
Name: Matematik, dtype: int64

In [19]:
# birden fazla kolon seçme işlemi
df[['Öğrenci','Matematik','Fizik']]

  Öğrenci  Matematik  Fizik
0    Ayşe         85     42
1   Fatma         65     51
2     Ali         35     38
3    Ömer         92     64
4    Buse         88     75
5   Evren         76     30
6  Zeynep         95     15

In [20]:
# matematik notu 70'ten büyük olan öğrencileri listeleme
df[df['Matematik'] > 70]

  Öğrenci  Matematik  Fizik  Yaş Sınıf
0    Ayşe         85     42   17   11A
3    Ömer         92     64   18   11B
4    Buse         88     75   17   11B
5   Evren         76     30   19   11A
6  Zeynep         95     15   19   11C

In [24]:
# birden fazla kolon için head kullanma
df[['Öğrenci','Matematik','Yaş']].head(4)

  Öğrenci  Matematik  Yaş
0    Ayşe         85   17
1   Fatma         65   18
2     Ali         35   17
3    Ömer         92   18

In [ ]:
# satır bazında filtreleme
# matematik puanları 80'den falza olan öğrenci bilgierlini listeleyiniz.
# select * from öğrenciler where matematik > 80

df[df['Matematik'] > 80]

  Öğrenci  Matematik  Fizik  Yaş Sınıf
0    Ayşe         85     42   17   11A
3    Ömer         92     64   18   11B
4    Buse         88     75   17   11B
6  Zeynep         95     15   19   11C

In [28]:
# matematik dersinden 70'den fazla alan öğrenciler ve aynı zamanda fizik dersinden 50'den fazla alan öğrencileri listeleyiniz.
# and -> & , or -> |
df[(df['Matematik'] > 70) & (df['Fizik'] > 50)]

  Öğrenci  Matematik  Fizik  Yaş Sınıf
3    Ömer         92     64   18   11B
4    Buse         88     75   17   11B

In [29]:
#11A sınıfındaki öğrencileri listeleyiniz.
df[df['Sınıf'] == '11A']

  Öğrenci  Matematik  Fizik  Yaş Sınıf
0    Ayşe         85     42   17   11A
5   Evren         76     30   19   11A

In [30]:
# kolon ekleme
df['Ortalama'] = (df['Matematik'] + df['Fizik']) / 2
df

  Öğrenci  Matematik  Fizik  Yaş Sınıf  Ortalama
0    Ayşe         85     42   17   11A      63.5
1   Fatma         65     51   18   11B      58.0
2     Ali         35     38   17   11C      36.5
3    Ömer         92     64   18   11B      78.0
4    Buse         88     75   17   11B      81.5
5   Evren         76     30   19   11A      53.0
6  Zeynep         95     15   19   11C      55.0

In [31]:
df['Cinsiyet'] = ['K','K','E','E','K','E','K']
df

  Öğrenci  Matematik  Fizik  Yaş Sınıf  Ortalama Cinsiyet
0    Ayşe         85     42   17   11A      63.5        K
1   Fatma         65     51   18   11B      58.0        K
2     Ali         35     38   17   11C      36.5        E
3    Ömer         92     64   18   11B      78.0        E
4    Buse         88     75   17   11B      81.5        K
5   Evren         76     30   19   11A      53.0        E
6  Zeynep         95     15   19   11C      55.0        K

In [32]:
# ortalama sütununa göre artan bir şekilde sıralama
df.sort_values('Ortalama')

  Öğrenci  Matematik  Fizik  Yaş Sınıf  Ortalama Cinsiyet
2     Ali         35     38   17   11C      36.5        E
5   Evren         76     30   19   11A      53.0        E
6  Zeynep         95     15   19   11C      55.0        K
1   Fatma         65     51   18   11B      58.0        K
0    Ayşe         85     42   17   11A      63.5        K
3    Ömer         92     64   18   11B      78.0        E
4    Buse         88     75   17   11B      81.5        K

In [33]:
# azalan bir şekilde sıralama
df.sort_values('Ortalama', ascending=False)

  Öğrenci  Matematik  Fizik  Yaş Sınıf  Ortalama Cinsiyet
4    Buse         88     75   17   11B      81.5        K
3    Ömer         92     64   18   11B      78.0        E
0    Ayşe         85     42   17   11A      63.5        K
1   Fatma         65     51   18   11B      58.0        K
6  Zeynep         95     15   19   11C      55.0        K
5   Evren         76     30   19   11A      53.0        E
2     Ali         35     38   17   11C      36.5        E

In [ ]:
df.sort_values('Öğrenci', ascending=False)
# asc -> artan
# desc -> azalan

  Öğrenci  Matematik  Fizik  Yaş Sınıf  Ortalama Cinsiyet
3    Ömer         92     64   18   11B      78.0        E
6  Zeynep         95     15   19   11C      55.0        K
1   Fatma         65     51   18   11B      58.0        K
5   Evren         76     30   19   11A      53.0        E
4    Buse         88     75   17   11B      81.5        K
0    Ayşe         85     42   17   11A      63.5        K
2     Ali         35     38   17   11C      36.5        E

In [ ]:
# gruplama
# mean() count() min() max() sum() gibi fonksiyonlar kullanılabilir.

In [44]:
# sınıflara göre ortalama hesaplama
df.groupby('Sınıf')['Ortalama'].mean()

Sınıf
11A    58.25
11B    72.50
11C    45.75
Name: Ortalama, dtype: float64

In [45]:
# sınıflara göre öğrenci sayısı
df.groupby('Sınıf')['Öğrenci'].count()

Sınıf
11A    2
11B    3
11C    2
Name: Öğrenci, dtype: int64

In [46]:
# cinsiyete göre öğrenci sayısı
df.groupby('Cinsiyet')['Öğrenci'].count()

Cinsiyet
E    3
K    4
Name: Öğrenci, dtype: int64

In [48]:
df.groupby('Yaş')['Ortalama'].mean()

Yaş
17    60.5
18    68.0
19    54.0
Name: Ortalama, dtype: float64

In [47]:
# yaş alanına göre not ortalaması en büyük olan notları listeleyiniz.
df.groupby('Yaş')['Ortalama'].max()

Yaş
17    81.5
18    78.0
19    55.0
Name: Ortalama, dtype: float64

In [49]:
# en başarılı öğrenci
df.loc[df['Ortalama'].idxmax()]

Öğrenci      Buse
Matematik      88
Fizik          75
Yaş            17
Sınıf         11B
Ortalama     81.5
Cinsiyet        K
Name: 4, dtype: object

In [50]:
# matematikte en başarılı öğrenci
df.loc[df['Matematik'].idxmax()]

Öğrenci      Zeynep
Matematik        95
Fizik            15
Yaş              19
Sınıf           11C
Ortalama       55.0
Cinsiyet          K
Name: 6, dtype: object

In [63]:
df['Ortalama'].idxmax()

4

In [64]:
df['Ortalama'].idxmin()

2

In [51]:
# en başarısız öğrenci
df.loc[df['Ortalama'].idxmin()]

Öğrenci       Ali
Matematik      35
Fizik          38
Yaş            17
Sınıf         11C
Ortalama     36.5
Cinsiyet        E
Name: 2, dtype: object

In [52]:
# matematikte en başarısız öğrenci
df.loc[df['Matematik'].idxmin()]

Öğrenci       Ali
Matematik      35
Fizik          38
Yaş            17
Sınıf         11C
Ortalama     36.5
Cinsiyet        E
Name: 2, dtype: object

In [65]:
# sınıf bazında başarı sıralaması
df.groupby('Sınıf')['Ortalama'].mean().sort_values(ascending=False)

Sınıf
11B    72.50
11A    58.25
11C    45.75
Name: Ortalama, dtype: float64

In [53]:
# excell' akatrma
exc1_data = df.sort_values('Öğrenci', ascending=False)
exc1_data

  Öğrenci  Matematik  Fizik  Yaş Sınıf  Ortalama Cinsiyet
3    Ömer         92     64   18   11B      78.0        E
6  Zeynep         95     15   19   11C      55.0        K
1   Fatma         65     51   18   11B      58.0        K
5   Evren         76     30   19   11A      53.0        E
4    Buse         88     75   17   11B      81.5        K
0    Ayşe         85     42   17   11A      63.5        K
2     Ali         35     38   17   11C      36.5        E

In [60]:
exc1_data.to_excel('ogrenci_notları.xlsx')

In [57]:
exc1_data.to_csv('ogrenci_notları.csv')

In [66]:
# pandas ile csv okuma
df1 = pd.read_csv('weather_data.csv')
df1.head()

         Date      City  Temperature   Humidity
0  2023-01-01  İstanbul    16.151138  61.351535
1  2023-01-02     Bursa    33.735633  54.334652
2  2023-01-03     Bursa    22.349836  77.209762
3  2023-01-04     İzmir     7.191749  71.983702
4  2023-01-05    Ankara    10.547860  73.048585

In [68]:
df1['ortalama'] = (df1['Temperature'] + df1['Humidity']) / 2
df1

          Date      City  Temperature   Humidity   ortalama
0   2023-01-01  İstanbul    16.151138  61.351535  38.751337
1   2023-01-02     Bursa    33.735633  54.334652  44.035143
2   2023-01-03     Bursa    22.349836  77.209762  49.779799
3   2023-01-04     İzmir     7.191749  71.983702  39.587725
4   2023-01-05    Ankara    10.547860  73.048585  41.798223
..         ...       ...          ...        ...        ...
95  2023-04-06   Antalya    -0.445999  71.817181  35.685591
96  2023-04-07    Ankara    -2.456281  66.878091  32.210905
97  2023-04-08     İzmir    19.871719  39.765404  29.818561
98  2023-04-09   Antalya    21.732137  32.799733  27.265935
99  2023-04-10     İzmir    12.896571  57.887549  35.392060

[100 rows x 5 columns]